{
  "posts": [
    {
      "title": "MEB ve Turkcell’den geleceğin yazılımcıları için istihdam seferberliği!",
      "date": "2022-12-02",
      "url": "https://shiftdelete.net/wp-content/uploads/2022/09/turkcell-gelecegi-yazanlar-1.jpg",
      "category": "Yazılım",
      "writer": "Şafak Şenol",
      "body": "Turkcell, hayata geçirdiği eğitim programlarıyla Türkiye'nin nitelikli iş gücüne katkıda bulunmaya devam ediyor.Turkcell “Geleceği Yazanlar – Gençlere Yatırım, Geleceğe Yazılım” Programı’yla yeni bir eğitim ve istihdam seferberliği başlattı. Milli Eğitim Bakanlığı ve Turkcell iş birliğiyle Türkiye’de ilk kez hayata geçirilen bu mesleki eğitim programıyla, üniversite son sınıf öğrencileri ve mezunlara yazılım teknolojileri alanında eğitim, sertifikasyon ve istihdam imkanı sağlanacak.6 ay sürecek program boyunca bire bir mentorluk desteği de alacak olan katılımcılar, programı başarıyla tamamlamalarının ardından Turkcell’in yeni yazılım şirketi Atmosware ve Turkcell grup şirketlerinde çalışma imkanına kavuşacak.Hayata geçirdiği eğitim programlarıyla Türkiye’nin nitelikli iş gücüne katkıda bulunmaya devam eden Turkcell, Milli Eğitim Bakanlığı ile Turkcell arasında imzalanan protokol kapsamında gençlere önemli bir imkan sunuyor. Gençlerin yazılım dünyasına hazırlanması, kodlama alanında yüksek yetkinliklere sahip olması ve bu sayede yerli yazılım ekosistemine nitelikli iş gücünün kazandırılması amaçlayan Turkcell Türkiye’de ilk olan programla fark yaratmayı amaçlıyor.2013 yılından bu yana kullanıcılarına ücretsiz yazılım eğitimleri sunan Turkcell Geleceği Yazanlar platformu, bu alana ilgi duyan herkesi geleceğe hazırlamaya devam ediyor. Toplumun tüm kesimlerinin hayallerini gerçekleştirmesini ve geleceğin dünyasına hazır olmasını amaçlayan Turkcell, bu çalışmasıyla yazılım öğrenmek isteyen herkes için imkansızlıkları ortadan kaldırıyor.",
      "id": 1
    },
    {
      "title": "Samsung ‘kendin tamir et’ uygulamasını genişletiyor!",
      "date": "2022-11-28",
      "url": "https://shiftdelete.net/wp-content/uploads/2022/11/samsung-6-640x360.webp",
      "category": "Teknoloji",
      "writer": "ShiftDelete.com",
      "body": "Samsung, kendin onar programı için yeni bir uygulama üzerinde çalışıyor. Şirket, bunun için ticari bir marka başvurusundan bulundu.Son zamanlarda özellikle teknolojik ürünlerde ‘kendin onar’ devri başladı. Son haberlere göre Samsung da bu hizmet için bir adım atıyor. Şirket, kendi cihazlarını tamir etmek isteyen kullanıcılara yardımcı olmak için yeni bir uygulama üzerinde çalışıyor. Ortaya çıkan bilgilere göre Samsung, yeni bir ticari marka başvurusu yaptı.Günümüzde teknoloji kullanıcıları, şirketten bağımsız olarak cihazlarını kendi kendilerine onarıyor. Bu programa katılan isimlerden biri de Samsung oluyor. Bilgilere göre şirket, ‘Self Repair Assist’ adlı bir mobil uygulama için ABD Patent ve Ticari Marka Ofisi‘ne (UPSTO) yeni bir ticari marka başvurusunda bulundu.Başvuru sırasında görünen uygulamanın simgesi, mavi bir arka plan üzerinde stilize edilmiş bir dişli çark ve İngiliz anahtarından oluşuyor. Uygulamayla ilgili ise bir açıklama yer aldı. “Akıllı saatlerin, tabletlerin, cep telefonlarının ve kulaklıkların kendi kendine kurulumu ve kendi kendine bakımı için cep telefonlarına yönelik bilgisayar uygulama yazılımı.Açıklamaya göre Samsung, kendin onar programını Galaxy saatleri ve kulaklıklarını içerecek şekilde genişletiyor. Şirketin mevcut programı, Galaxy S20 serisi, Galaxy S21 serisi ve Galaxy Tab S7 Plus olmak üzere telefon ve tabletlerle sınırlı. Bununla birlikte amaç kullanıcılarının kendin yap onarımları için telefon parçaları ve araçları edinmelerine izin vermek oldu.",
      "id": 2
    },
    {
      "title": "HYUNDAI televizyonları Türkler üretecek!",
      "date": "2022-11-25",
      "url": "https://shiftdelete.net/wp-content/uploads/2022/11/hyundai-tv.jpeg",
      "category": "Televizyon",
      "writer": "Hyundai.com",
      "body": "TV, uydu alıcısı ve küçük ev aletleri sektöründe faaliyet gösteren Skytech, TV grubunda Hyundai TV modellerini ülkemizde üretecek.TV, uydu alıcısı ve küçük ev aletleri sektöründe faaliyet gösteren Skytech, TV grubunda Hyundai’nin 5 ülkedeki üretim, satış, pazarlama ve dağıtım haklarını aldığını imza töreniyle duyurdu. Şirket, 3 yıl boyunca Hyundai marka televizyon üreterek Türkiye, Bosna-Hersek, Bulgaristan, Sırbistan ve Hırvatistan’a satışını gerçekleştirecek. Skytech basın toplantısına katıldık! HYUNDAI TV modelleri ne zaman geliyor?Ünsal Group çatısı altında faaliyet gösteren Skytech, Hyundai ile gerçekleştirdiği iş birliğinin imza töreni; Ünsal Group Yönetim Kurulu Başkanı Şinasi Ünsal, Skytech CEO’su Uğur Ünsal ve Hyundai Avrupa Şubeler Direktörü Hyundae Kim’in yanı sıra Sanayi ve Teknoloji Bakan Yardımcısı Mehmet Fatih Kacır’ın da katılımıyla gerçekleşti.Hyundai’nin televizyon grubunda 5 ülkenin üretim, satış, pazarlama ve dağıtım haklarını alan Skytech, iş birliği kapsamında, 3 yıl boyunca Hyundai markasıyla ürettiği televizyonları Türkiye, Bosna-Hersek, Bulgaristan, Sırbistan ve Hırvatistan’a satacak.IFA 22 etkinliğinde yerli TV üreticisi Skytech tarafından açılan standı gezdik. Burada yurt dışında satılacak son teknolojileri inceledik.İş birliği doğrultusunda bugüne kadar 20 milyon dolarlık üretim yatırımı gerçekleştiren Skytech, 2024 yılına kadar yaklaşık 10 milyon dolarlık daha ek yatırım yapacak. Avrupa’da global satış ağı kurmayı, depo açmayı da planlayan Skytech’in hedefleri arasında Hyundai’nin televizyon teknolojileri alanında dünyadaki en büyük tedarikçisi olmak yer alıyor.",
      "id": 3
    },
    {
      "title": "Xiaomi 13 serisinin işlemcisi resmen açıklandı!",
      "url": "https://shiftdelete.net/wp-content/uploads/2022/11/Xiaomi-13-iPhone-14-Pro-Maxi-geride-birakti-Iste-pil-omurleri-1-640x360.webp",
      "date": "2022-11-25",
      "category": "Telefon",
      "writer": "Xiaomi Türkiye",
      "body": "Xiaomi 13 serisinin hangi işlemci ile geleceği kısa bir süre önce belli oldu. Peki cihazların güç alacağı yonga hangisi?2022‘nin en çok beklenen akıllı telefonlarından birisi de Xiaomi 13 demek mümkün. Modellerle ilgili bugüne dek sayısız sızıntı ortaya çıktı. Bu sayede performans ve tasarım gibi konularda akıllarda soru işareti kalmadı. Çinli üretici dün cihazların tanıtım tarihini doğrularken, kısa süre önce de işlemcilerini netleştirdi.Xiaomi 13 serisi 1 Aralık’ta kullanıcıların beğenisine sunulacak. Çinli şirket, bir süre önce Weibo’dan paylaştığı görsellerle akıllı telefonların güç alacağı işlemcileri de açıkladı. Buna göre cihazlar önceki sızıntılarla doğru orantlı olarak Qualcomm Snapdragon 8 Gen 2’den güç alacaklar.4 nm teknolojisiyle üretilecek yonga setinde 1 adet 3.19 GHz ARM Cortex-X3, 2 adet 2.8 GHz ARM Cortex-A715, 2 adet 2.8 GHz ARM Cortex-A710 ve 3 adet 2.0 GHz ARM Cortex-A510 çekirdek kullanıyor. Qualcomm, yonga setinde Ray Tracing teknolojisini destekleyen Adreno 740 grafik arabirimine yer veriyor.Yeni işlemci, selefine oranla yüzde 30 performans artışı sağlayacak. Enerji verimliliğinde ise yeni modelin yüzde 40 daha iyi performans göstereceği açıklandı. Qualcomm, yeni işlemcisinde yapay zeka yeteneklerinin bir üst seviyeye çıkarıldığının altını çizdi. Doğal dil işleme (NLP) işlemlerinde anlık veri akışı sağlanabilecek. Bir başka deyişle kullanıcıların konuşmaları anlık olarak diğer dillere çevrilebilecek.",
      "id": 4
    },
    {
      "title": "GitHub Nedir ve Nasıl Kullanılır?",
      "url": "https://www.hostinger.web.tr/rehberler/wp-content/uploads/sites/6/2019/04/github-nedir-768x480.jpg",
      "date": "2022-12-03",
      "category": "Yazılım",
      "writer": "hostinger.web",
      "body": "Hiç GitHub nedir merak ettiniz mi? \nBu makalede size GitHub’ın ne olduğunu ve ne için kullanıldığını öğreteceğiz.\nGitHub, yazılım mühendisleri için önemli bir araç olarak kabul edilir ve popülaritesi rakipsizdir. \nŞu anda 25 milyondan fazla kullanıcıyı barındırmaktadır. \nBu, iş akışı ve işbirliği iyileştirmeleri için GitHub’a yönelen çok sayıda profesyonel anlamına gelir.\nKısacası GitHub, Git adlı bir sürüm kontrol sistemini (VCS) barındıran bulut tabanlı bir hizmettir. \nGeliştiricilerin, ilerlemelerini ayrıntılı olarak takip ederken ortak projelerde işbirliği yapmasına ve değişiklikler yapmasına olanak tanır.\nGitHub’ın ne olduğunu ve nasıl çalıştığını daha iyi anlamak için daha derine inmemiz gerekiyor. Önce sürüm kontrolü nedir bunu öğrenmeliyiz.",
      "id": 5
    },
    {
      "title": "Microsoft’u kıskandıran Windows 12 konsepti!",
      "url": "https://shiftdelete.net/wp-content/uploads/2022/12/microsoftu-kiskandiran-windows-12-konsepti.jpg",
      "date": "2022-12-02",
      "category": "Windows",
      "writer": "ShiftDelete.com",
      "body": "Microsoft’un büyük umutlar beslediği ve Windows tarihinde revizyon yapacağına inandığı en yeni işletim sistemi Windows 11, karışık yorumlar alıyor. Bu Windows 12 konsepti ise Microsoft’un yapamadığı bazı değişikliklere dikkat çekiyor.Windows 12’nin tasarımsal olarak nasıl olması gerektiğini gösteren son çalışma merak uyandırdı. Mevcut özellikleri çok daha kullanışlı hale getiren konsept, MacOS’tan da ilham almış gibi duruyor. Örneğin medya oynatıcısı, takvim programı ve hava durumunu içeren daha dinamik bir pencere bizleri karşılıyor.",
      "id": 6
    }
  ]
}